In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
df = pd.DataFrame({"groups": ["X", "Y", "Z", "X", "Y", "Z"], "val1": [2, 15, 25, 14, 3, 91], "val2": [92, 245, 345, 254, 103, 961]})

In [6]:
df

  groups  val1  val2
0      X     2    92
1      Y    15   245
2      Z    25   345
3      X    14   254
4      Y     3   103
5      Z    91   961

In [9]:
df.groupby("groups").sum()

        val1  val2
groups
X         16   346
Y         18   348
Z        116  1306

In [10]:
df.groupby("groups").mean()

        val1   val2
groups
X        8.0  173.0
Y        9.0  174.0
Z       58.0  653.0

In [12]:
def fil_func(x):
    return x["val2"].mean() < 200

In [13]:
df.groupby("groups").filter(fil_func)

  groups  val1  val2
0      X     2    92
1      Y    15   245
3      X    14   254
4      Y     3   103

In [15]:
df.groupby("groups").std()

             val1        val2
groups
X        8.485281  114.551299
Y        8.485281  100.409163
Z       46.669048  435.577777

In [16]:
df.groupby("groups").filter(lambda x: x["val2"].std() > 105)

  groups  val1  val2
0      X     2    92
2      Z    25   345
3      X    14   254
5      Z    91   961

In [17]:
# transform

In [18]:
df

  groups  val1  val2
0      X     2    92
1      Y    15   245
2      Z    25   345
3      X    14   254
4      Y     3   103
5      Z    91   961

In [21]:
df_new = df.loc[:, "val1": "val2"]

In [22]:
def normalize(x):
    return (x - x.min()) / (x.max() - x.min())

In [23]:
df_new.transform(normalize)

       val1      val2
0  0.000000  0.000000
1  0.146067  0.176064
2  0.258427  0.291139
3  0.134831  0.186421
4  0.011236  0.012658
5  1.000000  1.000000

In [24]:
df

  groups  val1  val2
0      X     2    92
1      Y    15   245
2      Z    25   345
3      X    14   254
4      Y     3   103
5      Z    91   961

In [25]:
df_new

   val1  val2
0     2    92
1    15   245
2    25   345
3    14   254
4     3   103
5    91   961

In [26]:
df_new.apply(np.sum)

val1     150
val2    2000
dtype: int64

In [27]:
df_new

   val1  val2
0     2    92
1    15   245
2    25   345
3    14   254
4     3   103
5    91   961

In [28]:
df_new.val1.apply(lambda x: x**3)

0         8
1      3375
2     15625
3      2744
4        27
5    753571
Name: val1, dtype: int64